hw4/app/controllers/dogs_controller.rb

  def index
    @dogs = Dog.all
---
SELECT "dogs".* FROM "dogs"

  def show
    last = Dog.last
    id = params[:id].to_i
    if Dog.count == 0
      @error = "No dogs in the table!"
    elsif id > last.id
      @error = "ID out of Bounds"
    else
      @dog = Dog.find(id)
---
SELECT  "dogs".* FROM "dogs"   ORDER BY "dogs"."id" DESC LIMIT 1
SELECT COUNT(*) FROM "dogs"
SELECT  "dogs".* FROM "dogs"  WHERE "dogs"."id" = ? LIMIT 1  [["id", 2]]

  def create
    @dog = Dog.create(dog_params)
---
INSERT INTO "dogs" ("age", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?)  [["age", 2], ["created_at", "2016-02-26 06:55:08.930056"], ["name", "Howard"], ["updated_at", "2016-02-26 06:55:08.930056"]]