hw3/app/controllers/pages_controller.rb

  def home()
    @cats = Cat.all
    @users = User.all
    @todos = Todo.all
    @incomplete = Todo.where finished: false
---
SELECT "cats".* FROM "cats"
SELECT "users".* FROM "users"
SELECT "todos".* FROM "todos"  WHERE "todos"."finished" = 't'