proj1/app/controllers/pokemon_controller.rb

  def damage
    pokemon = find()
    if pokemon.health > 0
      pokemon.update(health: pokemon.health - 10)
---
UPDATE "pokemons" SET "health" = ?, "updated_at" = ? WHERE "pokemons"."id" = ?  [["health", 90], ["updated_at", "2016-03-04 03:55:59.911766"], ["id", 3]]

  def heal
    pokemon = find()
    if pokemon.health < 100
      pokemon.update(health: pokemon.health + 10)
---
UPDATE "pokemons" SET "health" = ?, "updated_at" = ? WHERE "pokemons"."id" = ?  [["health", 100], ["updated_at", "2016-03-04 06:29:32.293946"], ["id", 6]]

  def create
    if (params.include?(:pokemon))
      submit = params[:pokemon]
      @pokemon = Pokemon.create name: submit[:name], trainer_id: current_trainer.id, level: 1, health: 100, EXP: 0
      if !@pokemon.errors.blank?
---
INSERT INTO "pokemons" ("name", "trainer_id", "level", "health", "EXP", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "MewTwo"], ["trainer_id", 5], ["level", 1], ["health", 100], ["EXP", 0], ["created_at", "2016-03-04 06:53:27.913181"], ["updated_at", "2016-03-04 06:53:27.913181"]]
SELECT  "pokemons".* FROM "pokemons" WHERE "pokemons"."name" = ? LIMIT 1  [["name", "Salamander"]]
SELECT  1 AS one FROM "pokemons" WHERE "pokemons"."name" = 'Salamander' LIMIT 1