proj1/app/controllers/trainers_controller.rb

  def index
    @trainers = Trainer.all
---
SELECT "trainers".* FROM "trainers"

  def show
    @trainer = Trainer.find(params[:id])
    @party = Pokemon.where(trainer_id: @trainer.id)
---
SELECT  "trainers".* FROM "trainers" WHERE "trainers"."id" = ?  ORDER BY "trainers"."id" ASC LIMIT 1  [["id", 5]]
SELECT "pokemons".* FROM "pokemons" WHERE "pokemons"."trainer_id" = ?  [["trainer_id", 5]]