app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
  def create
    @post = Post.new(post_params)

    if @post.save